{
  "posts": [
    {
      "id": 1,
      "title": "A Criação Deste Blog",
      "hook": "Neste primeiro artigo do blog, compartilho as escolhas tecnológicas que guiaram a criação deste projeto, além de um pouco do meu processo de desenvolvimento. Aqui, você poderá acompanhar minha jornada na construção deste espaço, que servirá tanto como portfólio quanto como um local para compartilhar artigos sobre minha trajetória profissional.",
      "content": "<h2>A Motivação por Trás Deste Projeto</h2><p>Há algum tempo venho pensando em como poderia criar um portfólio que não só mostre meus projetos, mas também um pouco mais sobre mim. No entanto, eu queria evitar aqueles projetos clichês, como os famosos projetos de Pokédex que vemos aos montes.</p><p>Este projeto, essencialmente, serve como uma base para futuros desenvolvimentos que pretendo fazer. Não foquei muito em conceitos avançados, pois minha intenção foi priorizar a simplicidade. Às vezes, menos é mais.</p><h3>Focando no Básico</h3><p>A escolha das ferramentas e bibliotecas foi bastante direta. Decidi que não precisava criar uma API do zero para este projeto, então optei por usar o JSON Server para simular uma API. Ele me permite adicionar novos registros no arquivo JSON (db.json) e, com isso, alterar dinamicamente a página principal e criar páginas específicas para cada post.</p><p>Uma funcionalidade interessante que implementei foi o uso do 'v-html' para exibir os posts. Isso me dá liberdade para personalizar a aparência de cada post sem precisar modificar o código-fonte diretamente. Escolhi o Axios pela sua simplicidade e flexibilidade para fazer requisições, algo que se encaixou perfeitamente no projeto.</p><p>Algo que também me trouxe uma experiência valiosa foi utilizar o ESLint junto com o Prettier. Essas ferramentas ajudam a manter boas práticas de desenvolvimento e a garantir a consistência do código.</p><p>Em relação ao CSS, optei pelo Tailwind. Embora eu esteja bastante acostumado com o Bootstrap, senti falta de algumas estruturas, mas a alta customização do Tailwind acabou sendo um ponto positivo, tornando-o uma escolha versátil para o projeto.</p><h3>Reflexões Finais</h3><p>Embora este tenha sido um projeto relativamente rápido de ser desenvolvido, eu me diverti bastante ao longo do processo. É gratificante ver uma ideia tomando forma: começa com experimentos de cores e formas no Figma, segue com algumas linhas de código, e antes que você perceba, já está no ar.</p><h3>Conclusão</h3><p>Apesar da simplicidade deste projeto, acredito que ele possui bastante valor. Ele serve como uma vitrine para outras habilidades que desejo demonstrar, além de ser um espaço onde posso compartilhar minhas ideias de maneira prática e eficiente.</p>",
      "img": "1",
      "author": "Alexandre Marques",
      "date": "28/10/2024"
    }
  ]
}
